TRUNCATE hospital.departments CASCADE;
INSERT INTO hospital.departments
VALUES (0, 'Кардиологическое отделение', 3, 5),
       (1, 'Венерологическое отделение', 2, 5),
       (2, 'Терапевтическое отделение', 1, 8),
       (4, 'Бухгалтерия', 10, NULL),
       (5, 'Обслуживающий персонал', NULL, NULL),
       (6, 'Руководство больницы', 0, NULL),
       (7, 'Приемное отделение', NULL, NULL);

TRUNCATE hospital.diacrisises CASCADE;
INSERT INTO hospital.diacrisises
VALUES (0, 'Здоров', 7),
       (1, 'Инфаркт', 0),
       (2, 'Ишемическая болезнь сердца', 0),
       (3, 'Сифилис', 1),
       (4, 'Гонорея', 1),
       (5, 'Пневмония', 2),
       (6, 'COVID-19', 2);

TRUNCATE hospital.employees CASCADE;
INSERT INTO hospital.employees
VALUES (0, 'Кисегач Анастасия Константиновна', 'Главный врач', 'Терапевт', '+79124753290', 6),
       (1, 'Быков Андрей Евгеньевич', 'Заведующий терапией', 'Терапевт', '+79162439040', 2),
       (2, 'Купитман Иван Натанович', 'Заведующий венерологией', 'Венеролог', '+79162439041', 1),
       (3, 'Лейков Алексей Валентинович', 'Заведующий кардиологией', 'Кардиолог', '+79606009221', 0),
       (4, 'Лобанов Глеб Александрович', 'Врач', 'Терапевт', '+79125789304', 2),
       (5, 'Романенко Глеб Викторович', 'Врач', 'Терапевт', '+79601002021', 2),
       (6, 'Клейменко Василиса Олеговна', 'Врач', 'Кардиолог', '+79852093031', 0),
       (7, 'Артемьев Артём Валерьевич', 'Врач', 'Кардиолог', '+79484759394', 0),
       (8, 'Косыгин Сергей Федорович', 'Врач', 'Травматолог', '+79480413211', 1),
       (9, 'Иванова Иванка Ивановна', 'Медсестра', NULL, '+79683001001', 0),
       (10, 'Петрова Петрашка Петровна', 'Медсестра', NULL, '+79683001002', 1),
       (11, 'Васильева Василиса Васильевна', 'Медсестра', NULL, '+79683001003', 2),
       (12, 'Самойлов Святослав Сергеевич', 'Охранник', NULL, '+79603212121', 5),
       (13, 'Колышкина Карина Александровна', 'Бухгалтер', NULL, '+79158001010', 4),
       (14, 'Карпова Елена Андреевна', 'Врач', 'Терапеват', '+79294373809', 7);

TRUNCATE hospital.drugs CASCADE;
INSERT INTO hospital.drugs
VALUES (0, 'Аспирин', 16),
       (1, 'Ивабрадин', 18),
       (2, 'Бивалирудин', 18),
       (3, 'Цефтриаксон', 18),
       (4, 'Гентамицин', 12),
       (5, 'Бензипециллин', 16),
       (6, 'Клацид', 12),
       (7, 'Интерферон-альфа', 6),
       (8, 'Арбидол', 0),
       (9, 'Нурофен', 6);

TRUNCATE hospital.drugs_x_diacrisises;
INSERT INTO hospital.drugs_x_diacrisises
VALUES (0, 0, 5),
       (1, 0, 1),
       (1, 1, 5),
       (2, 1, 7),
       (3, 2, 7),
       (4, 2, 14),
       (5, 3, 14),
       (0, 4, 5),
       (6, 4, 3),
       (7, 4, 5),
       (7, 5, 5),
       (8, 5, NULL),
       (9, 4, NULL),
       (9, 5, NULL);

TRUNCATE hospital.patients CASCADE;
INSERT INTO hospital.patients
VALUES (0, 'Канюшкин Александр Сергеевич', '+79002030405', 'M', DATE'01-03-2000', NULL, NULL),
       (1, 'Сергеев Станислав Евгеньевич', '+79120012030', 'M', DATE'23-09-1987', '5002657894849583', NULL),
       (2, 'Мельчук Ивран Алескерович', NULL, 'M', DATE'12-03-1956', '4657847585674939', '172954739471'),
       (3, 'Перестройкин Владлен Романович', NULL, 'M', DATE'06-09-2005', '5101658040395627', '12395048943'),
       (4, 'Плевакина Любовь Любовна', '+78003232323', 'F', DATE'14-05-1989', NULL, NULL),
       (5, 'Самойлова Станислава Борисовна', NULL, 'F', DATE'30-01-1976', '6587348539433929', '10038948912'),
       (6, 'Иванова Иванка Ивановна', '+79683001001', 'F', DATE'14-02-1995', '4590859475839481', NULL),
       (7, 'Ильина Альбина Антоновна', '+79685124058', NULL, DATE'14-08-2001', NULL, NULL),
       (8, 'Красильников Артемий Лебедович', '+79001001010', 'M', DATE'10-01-1981', '4389490348920402', NULL),
       (9, 'Немо Никто Александрович', '+79561082210', NULL, DATE'11-01-1903', '1000100010001000', NULL);

/* record - patient - doctor - diagno - start - end - status - stationary*/
TRUNCATE hospital.treatment_history;
INSERT INTO hospital.treatment_history
VALUES (0, 0, 1, 5, TIMESTAMP'01-04-2020', TIMESTAMP'08-04-2020', 'OK', FALSE),
       (1, 1, 1, 5, TIMESTAMP'02-04-2020', TIMESTAMP'15-04-2020', 'OK', TRUE),
       (2, 0, 4, 6, TIMESTAMP'11-06-2020', TIMESTAMP'21-06-2020', 'D', TRUE),
       (3, 1, 2, 3, TIMESTAMP'19-07-2020', TIMESTAMP'25-07-2020', 'OK', TRUE),
       (4, 1, 2, 3, TIMESTAMP'25-07-2020', TIMESTAMP'02-08-2020', 'OK', FALSE),
       (5, 1, 8, 2, TIMESTAMP'29-09-2020', TIMESTAMP'11-10-2020', 'D', TRUE),
       (6, 2, 3, 1, TIMESTAMP'11-03-2020', TIMESTAMP'16-03-2020', 'OK', TRUE),
       (7, 2, 3, 1, TIMESTAMP'17-05-2020', TIMESTAMP'21-05-2020', 'OK', TRUE),
       (8, 2, 7, 2, TIMESTAMP'04-08-2020', TIMESTAMP'17-08-2020', 'OK', TRUE),
       (9, 3, 2, 0, TIMESTAMP'04-04-2020', TIMESTAMP'04-04-2020', 'OK', FALSE),
       (10, 3, 5, 6, TIMESTAMP'04-05-2020', TIMESTAMP'12-05-2020', 'OK', TRUE),
       (11, 3, 5, 0, TIMESTAMP'06-11-2020', TIMESTAMP'06-11-2020', 'OK', FALSE),
       (12, 4, 8, 0, TIMESTAMP'05-09-2020', TIMESTAMP'05-09-2020', 'OK', FALSE),
       (13, 4, 5, 6, TIMESTAMP'12-06-2020', TIMESTAMP'23-06-2020', 'OK', TRUE),
       (14, 9, 1, 6, TIMESTAMP'14-06-2020', TIMESTAMP'20-06-2020', 'OK', TRUE),
       (15, 9, 4, 6, TIMESTAMP'19-12-2020', TIMESTAMP'24-12-2020', 'D', FALSE),
       (16, 5, 8, 4, TIMESTAMP'20-07-2020', TIMESTAMP'03-08-2020', 'OK', TRUE),
       (17, 5, 8, 4, TIMESTAMP'10-10-2020', TIMESTAMP'24-10-2020', 'OK', FALSE),
       (18, 6, 2, 4, TIMESTAMP'11-10-2020', TIMESTAMP'23-10-2020', 'OK', TRUE),
       (19, 6, 1, 5, TIMESTAMP'12-12-2020', TIMESTAMP'23-12-2020', 'OK', FALSE),
       (20, 8, 6, 1, TIMESTAMP'20-11-2020', TIMESTAMP'22-11-2020', 'OK', TRUE),
       (21, 7, 2, 4, TIMESTAMP'21-12-2020', TIMESTAMP'31-12-2020', 'OK', FALSE),
       (22, 0, 8, 4, TIMESTAMP'22-12-2020', TIMESTAMP'30-12-2020', 'OK', TRUE);





